# 1)შექმენით სია სადაც იქნება მოთავსებული მანქანის ბრენდის სახელები
list = ["lamburgini" , "mclaren" , "subaru"]


# 2)შექმენით სია სადაც იქნება მოთავსებული იქნება მხოლოდ ინტეჯერის ტიპის რიცხვები
list = [5,6,7,,23,22,3,,32,32,3,23]


# 3)შექმენით სია სადაც მოთავსებული იქნება მხოლოდ float ტიპის რიცხვები
list = [12.4,5353.5,5353.5,535353.53]


# 4)შექმენით სია სადაც მოთავსებული გექნებათ ყველა მონაცემთა ტიპის ელემენტები და კომენტარის სახით დაწერეთ რომელ ინდქსზე მდებარეობს თითოეული ელემენტი,ეს 
#ინდექსები უნდა იყოს როგორც დადებითი ასევე უარყოფითი 
list = ["dato" , 15 , 16.8, True]
# dato არის 0 
# 15 არის 1 = -3 
# 16.8 არის 2 = -2
# True არის 3 = -1


# 5)შექმენით სია სადაც გექნებათ ყველა მონაცემთა ტიპის მონაცემი და თითოეული ელემენტი გამოიტანე ცალ ცალკე
list = ["dato" , 15 , 16.8, True]
print(list[0])
print(list[1])
print(list[2])
print(list[3])

# 6)შექმენით სია სადაც მოტავსებული გექნებათ ყველა მონაცემთა ტიპის მონაცემი და ტერმინალში გამოიტანეთ მთლიანი სია 
list = ["dato" , 15 , 16.8, True]
print(list)

# 7)მოცემული გაქვთ სია ["გიორგი", 15 , 50.50 , "წლის"] ტერმინალში გამოიტანე შემდეგი ტექსტი --> გიორგი 15 წლის
list = ["გიორგი", 15 , 50.50 , "წლის"]
print(list[0] + list[3])
# 8)მოცემული გაქვთ სია ["აკადემია", 50 , "ბექა" , 60.5 , "ირაკლი" ] შენი დავალება იქნება  ამ სიაში მოახდინო ცვლილება --> შეცვალე მენულე ინდექსზე მდგომი ელემენტი და მის მაგივრად იყოს "გოა" და ასევე შეცვალე ბოლო ინდექსზე მდგომი ელემენტი და მის მაგივრად უნდა იყოს "საბა" და დაპრინტე განახლებული სია ტერმინალში
list_num = ["აკადემია", 50 , "ბექა" , 60.5 , "ირაკლი" ]
list_num[0] = "goa"
list_num[4] = "saba"
print(list_num)