/*1)მომხმარებელს შემოატანინე სახელი prompt-ით.
თუ სახელი იწყება "A" ასოზე, კონსოლში გამოიტანე "სახელი იწყება A-ზე", სხვა შემთხვევაში "სახელი არ იწყება A-ზე".

let name = prompt("enter name")
if (name.startsWith("A"){
    console.log("სახელი იწყება A-ზე")
}else{
    console.log("სახელი არ იწყება A-ზე".)
    }


2)მომხმარებელს შემოატანინე პაროლი.
თუ პაროლის სიგრძე 8-ზე მეტია, გამოიტანე "ძლიერი პაროლი", სხვა შემთხვევაში "სუსტი პაროლი". გამოიყენე property რომელიც იგებს სტრინგის სიგრძეს

let pass = ("enter password")
if(pass.length > 8){
    console.log("ძლიერი პაროლი")
}else{
    console.log("სუსტი პაროლი")
    }

    3)მომხმარებელს შემოატანინე ტექსტი.
trim() გამოიყენე და თუ ტექსტის სიგრძე 0 გამოვიდა, დაწერე "ცარიელი ტექსტია", სხვა შემთხვევაში "ტექსტი შევსებულია".

let name = prompt("enter name")
if (name.trim() == 0 ){
    console.log("ცარიელი ტექსტია")
}else{
    console.log("ტექსტი შევსებულია")
    }
4)მომხმარებელს შემოატანინე რაიმე სახელი
 თუ სახელი იწყება ასო "ა" ზე გამოიტანე კონსოლში ცვლადში შენახული მნშვნელკობა ოღონდ დიდი ასოებით
სხვა შემთხვევაში გამოიტანე ცვლადში შენახული მნიშვნელობა პატარა ასოებში

let name = prompt("enter name")
if (name.startsWith("a")){
    console.log(name.touppercase)
}esle{
    console.log(name.tolowercase)
}

5)შექმენი ცვლადი სადაც შეინახავ რაიმე სტრინგს
შეამოწმე თუ სახელი იწყება ასო"კ" ზე კონსოლში გამოიტანე ამ ცვლადში შენახულიმნიშვნელობის სიგრძე
სხვა შემთხვევაში დაუკონსოლლოგე __> "error"
let str = prompt("enter str")
if (str.startrsWith("k")){
    console.log(str.length)
}esle{
    xonsole.log("error")
}

*/

