# 1)შექმენით სია სადაც მოცემული იქნება ყველა მონაცემთა ტიპის ელემენტები,თქვენი დავალებაა სიის ბოლოში დაამატოთ ნებიემიერი რამ,გამოიყენეთ append ფუნქცია,მოიგონეთ 2 მაგალითი თქვენითაც
list1 = ["dato" , 15, True , 176.676 ,]
list1.append("datogio")
print(list1)
list1 = ["dato" , 15, True , 176.676 , ]
list1.append("tengogio")
print(list1)

# 2)შექმენით სია სადაც მოცემული იქნება ყველა მონაცემთა ტიპის ელემენტები,თქვენი დავალებაა სიაში მესამე მეხუთე და მეშვიდე ინდექსზე დაამატოთ ელემენტები,გამოიყენეთ insert ფუნქცია,მოიგონეთ 2 მაგალითი თქვენითაც და დაამატეთ ელემენტები სხვადასხვა ინდექსებზე
list2= ["dato" , 15, True , 176.676 , "lekso" , "vaja" ]
list2.insert(7,"mtvare")
list2.insert(5,65)
# 3)კომენტარის სახით ახსენით რა განსხვავენა და მსგავსებააა insert და append ფუნქციებს შორის
# insert და append  განსხვავდება იმით რომ აპენდში ბოლოში ამატებ და ინსერტში კი ნებისმიერ ადგილას

# 4)შექმენით სია სადაც მოცემული იქნება ყველა მონაცემთა ტიპის ელემენტები,თქვენი დავალებაა სიიდან ამოშალოთ მესამე მეორე და მეხუთე ინდექსზე მდგომი ელემენტები,გაამოიყენეთ pop ფუნქცია,მოიყვანეთ ორი სხვა მაგალითი სადაც გამოიყენებთ pop ფუნქციას
list3= ["dato" , 15, True , 176.676 , "lekso" , "vaja" ]
list3.pop(-1)
list3.pop(2)
list3.pop(3)
print(list3)
# 5)შექმენით სია სადაც მოცემული გექნებათ ყველა მონაცემთა ტიპის ელემენტები,თქვენი დავალებაა ამოშალოთ სიიდან სამი ელემენტი,გამოიყენეთ remove ფუნქცია,მოიყვანეთ ორი სხვა მაგალითი სადაც გამოიყენებთ remove ფუნქციას
list3= ["dato" , 15, True , 176.676 , "lekso" , "vaja" ]
list3.remove(15)
list3.remove(True)
list3.remove("vaja")
# 6)კომენტარის სახით ახსენით რა მსგავსება და განსხვავებაა pop და remove ფუნქციებს შორის
# სიის მონაცემის რიცხვს არა,პოპ ში ვწერთ ინდექსს ანუ რომელ ინდექსზე მდგომი ელემენტის ამოშლა გვინდა

# 7)შექმენით ორი სია,პირველ სიაში გექნებთ მხოლოდ string ტიპის მონაცემები მეორე სიაშ კი მხოლოდ ინტეჯერები,თქვენი დავალებაა ეს ორი სია გააერთანოთ extend ფუნქციის დახმარებით,შემდეგ შექმენით კიდევ ერთი სია სადაც გექნებათ მხოლოდ float ტიპის მონაცემები და გააერთიანეთ პირვეი ორი გაერთიანებული სია მესამე სიაში
list4 = ["dato" , "gio" , "lekso" , "robi"]
list5 = [14 ,15, 132, 212, 121,]
list4.extend(list5)
print(list4)