# 1)1 დან 10 მდე გაიგეთ რიცხვების ჯამი,გამოიყენეთ for loop
sum = 0
for i in range(1, 11):
    sum += i
print(sum)

# 2)შექმენით ფუნქცია რომელიც გაიგებს ორი რიცხვის ჯამს
def add_numbers(a, b):
    result = a + b
    return result

print(add_numbers(3,5))

# 3)შექმენით ფუნქცია რომელიც გაიგებს სიაში მყოფი ლუწი რიცხვების ჯამს
def dd(numbers):
    total = 0
    for num in numbers:
        if num % 2 == 0:
            total += num
    return total

print(dd([1, 2, 3, 4, 5, 6]))


# 4) შექმენით ფუნქცია რომელსაც გადაეცემა წინადადება დაა თითოეული სიტყვა ამ წინადადებაში გამოყოფილი იყოს სფეისებით,თქვენი დავალებაა ამ წინადადებაში მყოფი სიტყვები წარმოაგგინოთ სიის სახით(გამოიყენეთ შესაბამისი ფუნქცია),შემდეგ ამ სიას გადაუარეთ და შეამოწმეთ,თუ ამ სიაშიმოცემულუ სიტყვის სიგრძე ნაკლებიაა 5 ზე,დაპრინტეთ ნაკლებია 5 ზე,სხვა შემთხვევაში დაპრინტეთ მეტია 5 ზე
def ss(sentence):
    words= sentence.split()
    for word in words:
        if len(word) < 5:
            print("naklebia 5")
        else:
            print("metia xutze")

print(ss("მე მიყვარს პროგრამირება"))





