# 1)შექმენით სამი ცვლადი snake_case ის გამოყენებით მიანიჭეთ ამ ცვლადებსი სასურველი მნიშვნელობები და გამოიტანეთ ტერმინალში
user_name = "dato"
user_surname = "miribiani"
user_age = 15
print(user_name + user_surname + str(user_age))


# 2)კომენტარის სახით ახსენით რამდენი ცვლადია მოცემულ ფოტოში შექმნილი,დაწერეთ თქვენი პასუხი და ახსენით ასევე რატომ,ასევე შექმენით სამი ცვლადი იგივენაირად და ახსენით რასაც გააკეთებთ კომენტარის სახით
# ფოტოში მოცემულია 3 ცვლადი რადგან ერთ ასოს ძალიან დიდი მნიშნელობა აქ  აიტომაც 3 ცვლადი და თუ ერთი და იგივეა მაში 1 მნიშნელობა აქ


#3) კომენტარის სახით ახსენით რა არის კონკატინაცია და მოიყვანეთ მაგალითები
# კონკატინაცია არის 2 ან რამდენიმე ცვლადის გაერთიანება

# 4)შექმენით ცვლადები სადაც შეინახავთ სახელს გვარს ასაკს სიმაღლეს და საცხოვრებელ ადგილს,თქვენი დავალება იქნება გამოიტანოთ ეს ყველაფერი ერთ გრძელ წინადადებად გამოიყენეთ ნასწავლი მასალა int() str()...

name = input("enter your name:")
surname = input("enter your surname:")
age = input("enter your age :") 
living_place = input("enter your livingplace:")
height = input("enter your height:") 
print(name + surname + str(age) + living_place + str(height))


#5) მომხმარებელს შემოატანინეთ ავტომობილის სახელი,ავტომობილის ფერი,ავტომობილის ფასი და ასევე შემოატანინეთ ავტომობილის გამოშვების თარიღი და შენინახეთ ეს ყველაფერი ცვლადებში,input ებთან როგორც გასწავლეთ თ რიცხვი შემოაქვს მომხმარებელს გადააქციეთ ეს input ები ინტეჯერებად და ამის შემდეგ მოახდინეთ ამ ყველაფრის კონკატენაცია ანუ გამოიტანეთ მომხმარებლის მიერ შემოყვანილი მნიშვნელობები ერთ გრძელ წინადადებად

car_model = input("enter your dream car:")
car_price = int(input("enter your dream car price:"))
car_color = input("enter your car color:")
car_year = int(input("enter your car year:"))
print(car_model + str(car_price) + car_color + str(car_year))


# 6)შექმენით 4 ცვლადი,ერთიში შეინახეთ ინტეჯერი,მეორეში სტრინგი,მესამეში ფლოუტი და მეოთხეში ბულეანის მნიშვნელობა
int_name =  5
str_name = "dato"
float_name = 4.7
bool_name = True and False


# 7)მომხმარებელს შემოატანინეთ საცხოვრებელი ადგილი და საყვარელი ცხოველი
cute_animal = input("enter your cute animal")
living_place = input("enter your livin place")
print(cute_animal + living_place)


# 8)8)შექმენით ცვლადი ამ ცვლადში შეინახეთ მნიშვნელობად ინტეჯერი და შემდეგ გადააქციეთ ეს ინტეჯერი სტრინგად(გამოიყენეთ შესაბამისი ფუნქცია,ბრჭყალებში არ ჩასვათ😁😆),ამის შემდეგ შექმენით მეორე ცვლადი და მნიშვნელობად მიანიჭეთ რაიმე რიცხვი ოღნდ ეს რიცხვი იყოს სტრინგი,თქვენი მოვალეობაა გადააქციოთ ეს სტრინგი რიცხვი ინტეჯერად(აქაც გამოიყენეთ შესაბამისი ფუნქცია
num = 10
print(str(num))
num_two = "124"
print(int(num_two))


# 9)მომხმარებელს შემოატანინეთ ორი რიცხვი,თქვენი დავალებაა მოახდინოთ ყველა მათემატიკური ოპერაცია ამ რიცხვებზე, +,-./,//,*,==,%,ასევე კომენტარის სახით ახსენით რას აკეთებს % ნიშანი (ვინც აქამდე ჩამოხვედით და წინ რაც იყო ყველაფერი გააკეთეთ YOU ARE REAL CHADS!RESPECT❤️❤️❤️
num_one = 15
num_two = 17
print(num_one + num_two)
print(num_one - num_two)
print(num_one * num_two)
print(num_one // num_two)
print(num_one == num_two)
print(num_one / num_two)
print(num_one % num_two)
print(num_one ** num_two)
 


# 10) 





