/*
1)შექმენით ფუნქცია რომელიც კონსოლში გამოიტანს ინფორმაციას შენს შესახებ

2)შექმენი ფუნქცია რომელიც ორ რიცხვს დაუმატებს ერთმანეთს და დააკონსოლლოგებს`

3)შექმენი ფუქნცია რომელიც კონსოლში გამოიტანს რაიმე მესიჯს თქვენი მომხმარებლისთვის

ფუნქცია გამოიძახე 5 ჯერ (ვითომ 5 მომხმარებელს უგზავნით რაიმე მესიჯს)
*/

function hello(){
    console.log("dato")
}



function number(){
    console.log(6 + 7)
}


function hello(name){
    console.log("dato")
}


hello()
hello()
hello()
hello()
hello()
hello()
hello()


/*
4) შექმენით ფუნქცია რომელსად პარამეტრად გადაეცემა შემდეგი ცვლადები num1 , num2 , num3

შენი დავალებააფუნქციამ კონსოლში გამოიტანოს ამ სამი რიცხვის ნამრავლი

გამოიძახე ფუნქცია ოთხჯერ ოღონდ განსხვავებული არგუმენტებით

5)შექმენი ფუნქცია და გადაეცი ერთი არგუმენტი --> name

ფუნქციამ უნდა დააკონსოლლოგოს ამ სახელის სიგრძე

გამოძახე ფუნქცია 3 ჯერ სხვადასხვა სახელებით

*/

function namee(num1 , num2 , num3){
    console.log(num1 * num2 *num3)
}

namee(8,4,2)
namee(1,6,3)
namee(4,7,4)
namee(5,6,4)


function name1(name){
    console.log(name.length)
}

name1('dat')
name1('giorgi')
name1('jumbera')






