# 1)შექმენით ფუნქცია რომელსაც გადაეცემა სახელებით სავსე სია,თქვენი დავალებაა გამოიტანოთ ამ სიაში მყოფი სახელების თითოეული ასო
def list1(user_list):
    for i in user_list:
        for u in i:
            print(u)
print(list1(["gio" , "luka" , "nika" , "saba"]))
# 2)შექმენით ფუნქცია სადაც მოთავსებული გექნებათ რიცხვები,თქვენი დავალებაა გააარკვიოთ თ ეს რიცხვი არის ლუწი და ამავდროულად დგას ლუწ ინდექსზე, მაშინ ეს რიცხვები დაამატე ახალ სიაში და იპოვეთ ამ ახალ სიაში მყოფი რიცხვების საშუალო არითმეტიკული
def sashvalo(numbers):
    new = []
    for i in numbers:
        if i  %2 == 0 and numbers.index(i) %2 ==0 :
            new.append(i) 
    return sum(new) // len(new)
print(sashvalo([1,2,3,4,5,6,7,8,9]))


# 3)შექმენით ცვლადი სადაც შეინახავთ მომხმარებლის შემოყვანილ რიცხვს,თქვენი დავალებაა 1 დან მომხმარებლის შემოტანილი რიცხვის ჩათვლით გამოიტანოთ  ლუწი რიცხვების ჯამი და კენტი რიცხვების რაოდენობა,შემდეგ  გაიგეთ ამ ორი რიცხვის(საბოლოო ჯამის და საბოლოო რაოდენობის) საშუალო არითმეტიკული
user = int(input("enter num :"))
def sashvalo(user_number):
    new = 0
    new2 = 0
    for i in range(1,user_number , 1):
        if i  %2 ==0 :
           i += new
        else :
            new2 +=1
    return new / new2
print(sashvalo(user))

# 4)მომხმარებელს შემოაყვანინე სახელი და რიცხვი,შენი დავალებაა იპოვო მომხმარებლის შემოტანილ სახელში მომხმარებლის შემოტანილ რიცხვზე რომელი ასობგერა დგას
name = input("enter name:")
number = int(input("enter number:"))
print(name[number])

# 5)შექმენი ცვლადი სადაც შეინახავ სიას,შემდეგ მომხმარებელს შემოატანინე რაიმე რიცხვი,შენი დავალებაა სიიდან გამოიტანო მომხმარებლის შემოტანილი რიცხვიდან სიის ბოლომდე ყველა ელემენტი
list1 = [1,2,3,4,5,6,7,8,9,10,11,12]
user =int(input("enter number:"))
print(list1[user::])
# 6)მომხმარებელს შემოატანინეთ სახელი და WHILE LOOP ის დახმარებით ამ სტრინგიდან გამოიტანეთ ყოველი მეორე ასო,იგივე FOR LOOP ითაც გააკეთეთ
name = input("enter name:")
for i in range(0,len(name),2):
    print(name[i])

name = input("enter name:")
a = 1
while a <len(name):
    print(name[a])
    a +=2

# 7)მომხმარებელს შემოაყვანინე პაროლი,ასევე შექმენი ცვლადი სადაც შეინახავ შენს პაროლს,შენი დავალებაა გააარკვიო,თუ მომხმარებლის შემოყვანილი პაროლი არ ემთხვევა შენს პატოლს მაშნ თავიდან გუამეორე რომ შემოიყვანოს პაროლი ხელახლა,შემდეგ თუ მომხმარებლის შემოტანილი პაროლი დაემთხვა შენს პაროლს დაუპრინტე რომ CORRECT 
password = input("enter passowrd" )
my_password = "datodato"
while password != my_password:
    password =  input("try again:")
print("corect")