# 3)მომხმარებელს შემოატანინე მისი სახელი,შემდეგ შემოატანინე ასაკი,და შემდეგ შემოატანინე მისი სიმაღლე ათწილადებში,გადააქციეთ ეს ყველაფერი შესაბამის მონაცემთა ტიპად
name = input("enter your name")
age =  int(input("enter your name"))
height = float(input("enter your height"))

# 4)შექმენი ორი ცვლადი num1 და num2 მიანიჭე მთელი რიცხვები,შენი დავალებაა გაიგო რა იქნება ნაშთი თუ პირველ რიცხვს გაყობ მეორეზე,ასევე უნდა გაიგო თუ რამდენჯერ მოთავსდება პირველ რიცხვშ მეორე რიცხვი,გამოიყენე შესაბამისი ოპერატორები
num1 = 15
num2 = 1645
print(num1 / num2)
print(num2 % num1)
               