# 1)შექმენით ფუნქცია რომელიც შეამოწმებს არის თუ არა გადმოცემულ სტრინგში ხმოვნები,თუ არის დააბრუნე ეს ხმოვნები ასევე  დაითვალე რამდენი ხმოვანი იყო მოცემულ სტრინგში
# def xmovani(user_str):
#     result = []
#     for i in user_str:
#         if i in "aeiou":
#             result.append(i)
            
#     return len(result)
# print(xmovani(["goa is the best academy"]))


# 2)მომხმარებელს შემოატანინეთ რაიმე რიცხვი,სანამ მომხმარებელი არ შემოიყვანს 10 ზე ნაკლებ რიცხვს გაუმეორეთ რომ თავიდან შემოიტანოს,თან არასწორად შემოყვანილი მნიშნველობები ჩაამატეთ სიაში
# num = int(input("enter num:"))
# result = 0
# while num < 10:
#     result +=1
#     input("try again")
# print("correct")


# 3)შექმენი ფუნქცია,რომელსაც გადაეცემა სია ამ სიაში იქნება მოთავსებული პატარა ასოებით დაწერილი სახელები,თქვენი დავალებაა ახალ სიაში დაამატოთ ყველა ელემენტი ოღონდ ისინი უნდა იყოს დიდი ასოებით დაწერილი

# def list1(user_list):
#     result = []
#     for  i in user_list:
#         result.append(i.upper())
#     return result
# print(list1(["dato" , "gio" , "luka"]))


# 4)შექმენი ფუნქცია რომელსაც გადაეცემა სტრინგი,თქვენი დავალებაა ეს სტრინგი შემოატრიალოთ,შემდეგ კი ამ დააბრუნოთ შემოტრიალებული  სტრინგს რომ ქონდეს პირველი ასო დიდი
def str1(str2):
        reversed1= str2[::-1]
        reversed1.capitalize()
        return reversed1
print(str1("goaisbest"))


# 5)შექმენით ფუნქცია რომელსაც გადაეცემა სია,ამ სიაში მოთავსებული იქნება როგორც სტრინგები ასევე ინტეჯერები,თქვენი დავალებაა გაიგოთ სოაში მყოფი სტრინგების რაოდენობა და ასევე უნდა გაიგოთ სიაში მყოფი ინტეჯერების ჯამი
def list1(user_str,user_int ):
    
print(list1(["goabest", 1,2,3,4,5,6]))


# 6)შექმენით ფუნქცია რომესლსაც გადაეცემა რიცხვებით სავსე სია,თქვენი დავალებაა გაიგოთ ამ რიცხვების საშუალო არითმეყიკული,შემდეგ 0 დან ამ რიცხვამდე(საშუალო არითმეტიკული),იპოვეთ ყველა ლუწი რიცხვის ჯამი

