# 1)შექმენი ცვლადი გადაეცი სმანქანის სახელი რომელიც იქნება პატარა ასოებით დაწერილი,შენი დავალებაა გადააქციო მისი პირველი ასო დიდად,გამოიყენეთ შესაბამისი ფუნქცია --> მოიყვანე კიდევ ორი იგივენაირი  მაგალით შენით მოიფიქრე 
car_brend = "mclaren"
print(car_brend.capitalize())
car_brend = "porsche"
print(car_brend.capitalize())
car_brend = "buggati"
print(car_brend.capitalize())

# 2)შექმენი ცვლადი გადაეცი  ხილის სახელი რომელიც იქნება პატარა ასოებით დაწერილი,შენი დავალებაა გადააქციო მისი ყველა ასო დიდად,გამოიყენეთ შესაბამისი ფუნქცია--> მოიყვანე კიდევ ორი  იგივენაირი  მაგალით შენით მოიფიქრე 
fruit= "vashli"
print(fruit.upper())
fruit = "atami"
print(fruit.upper())

# 3)შექმენი ცვლადი გადაეცი  ქვეყნის სახელი რომელიც იქნება დიდი ასოებით დაწერილი,შენი დავალებაა გადააქციო მისი ყველა ასო პატარად,გამოიყენეთ შესაბამისი ფუნქცია
counrty = "SAQARTVELO"
print(counrty.lower())
counrty = "BULGARETI"
print(counrty.lower())
counrty = "RUSSIA"
print(counrty.lower())
# 4)შექმენი ცვლადი და გადაეცი მას ქალაქის სახელი მაგალითად "tbilisi" ,შენი დავალებაა გაიგო რომელ ინდექსზე დგას ასო "s",გამოიყენე შესაბამისი ფუნქცია  --> მოიყვანე კიდევ ორი იგივენაირი  მაგალით შენით მოიფიქრე 
name = "tbilisi"
print(name.find("s"))
name = "dubai"
print(name.find("d"))
# 5)შექმენი სია -->["ირაკლი","ბექა",50,"ატამი",40.50,"თვითმფრინავი"],თქვენი დავალებაა გაიგოთ რომელ ინდექსზე დგას "ატამი" და 50,გამოიყენეთ შესაბამისი ფუნქცია--> მოიყვანე კიდევ ორი იგივენაირი  მაგალით შენით მოიფიქრე 
list = ["ირაკლი","ბექა",50,"ატამი",40.50,"თვითმფრინავი"] 
print(list.index("ატამი"))
print(list.index(50))

# 6)შექმენით სია სადაც გექნებათ მოთავსენული სახელები რომლებიც იქნებიან პატარა ასოებით დაწერილი,თქვენი დავალებაა გადააქციოთ სიაში მყოფი ყველა სახელის პირველი ასო დიდად(არ გამოიყენოთ ინდექსები და მასე არ მიწვდეთ ელემენტებს)
name_list = ["dato" , "gio" , "tengo" , "vaja" , "lekso"]
for i in name_list:
    print(i.capitalize())




# 7)შექმენით სია სადაც გექნებათ მოთავსენული ქვეყნის სახელები რომლებიც იქნებიან პატარა ასოებით დაწერილი,თქვენი დავალებაა გადააქციოთ სიაში მყოფი ყველა სახელის ყველა ასო დიდად(არ გამოიყენოთ ინდექსები და მასე არ მიწვდეთ ელემენტებს)
name_list = ["saqartvelo" , "somxeti" , "azeirbaijani"]
for i  in name_list:
    print(i.upper())


# 8)შექმენით სია სადაც გექნებათ მოთავსენული ქვეყნის სახელები რომლებიც იქნებიან დიდი ასოებით დაწერილი,თქვენი დავალებაა გადააქციოთ სიაში მყოფი ყველა სახელის ყველა ასო პატარა ასოებად(არ გამოიყენოთ ინდექსები და მასე არ მიწვდეთ ელემენტებს)
name_list = ["SAKARTVELO" "SOMXETI" "BULGARETI" ]
for i in name_list:
    print(i.lower())