# 1)შექმენით ფუნქცია დაარქვით თქვენთვის სასურველი  სახელი,პარამეტრად გადაეცი ორი ცვლადი str1 და str2 და გამოძახების დროს ამ ცვლადებს გადაეცით სტრინგ ტიპის მნიშვნელობები,თქვენი დავალებაა ტერმინალში გამოიტანოთ ამ ორი სტრინგის გაერთიანება მაგ:helloworld
def names(str1,str2):
    return str1+str2
print(names("hello","world"))

# 2)შექმენით ფუნქვია რომელიც იპოვის ორი რიცხვის ნამრავლს,გამოიძახეთ რამდენჯერმე ეს ფუქნცია და გადაეცით არგუმენტად სხვადასხვა რიცხვები
def num(str1,str2):
    return str1*str2
print(num(34,15))
print(num(4,5))
print(num(344,145))
print(num(354,152))
print(num(3465,54515))
print(num(3544,15545))
print(num(35454,5415))
print(num(77634,15656))
print(num(3477,1995))


# 3)შექმენით ფუნქცია რომელსაც არგუმენტად გადასცემთ სიას,თქვენი დავალებაა იპოვოთ ამ სიაში მყოფი რიცხვების ჯამი

def sum(list1):
    sum1 = 0
    for i in list1 :
        sum1 += i
    return sum1
print(sum[1,23,24,2,4,34,23,23,])
