# 4)შექმენი ორი ცვლადი სადაც შეინახავ რიცხვებს და მოახდინე ყველა მატემატიკური და შედარების ოპერატორები,გვერდით კომენტარის სახით მიუწერე რომელი რას აკეთებს
num = int(input("enter your num"))
num1 = int(input("enter your num"))
print(num + num1) # ერთ ცვლადს უმათებს მეორეს
print(num / num1) # ერთ ცვლადი ყოფს მეორეს
print(num - num1) # ერთ ცვლადს აკლებს მეორეს
print(num * num1) # არავლებს
print(num ** num1) #  ხარისხად აუავს
print(num // num1) # რიცხვი რიცხვში რამდენჯერ ეტევა
print(num % num1) # ერთ ცვლადს პროცენტში აყავს(ნაწილად) მეორეს