# 1) კომენტარის სახით ახწერეთ თითოეული მონაცემთა ტიპის მნიშვნელობა და მოიყვანეთ მაგალითები

#string ---> str  = სტრინგი არის მონაცემთა ტიპი რომელიც წარმოადგენს პრჭყალებიან მონაცემს მაგ: name = "dato" 

# integer ---> int = ინტეჯერი არის მონაცემთა ტიპი რომელიც წარმოადგენს რიცხვს პრჭყალების გარეშე age = 15

# float ---> float =  ფლოათი  არის მონაცემთა ტიპი რომელიც წარმოადგენს ათწილად რიცხვს height = 1.66

# boolean ---> bool =  ბულლეანი არის მონაცემთა ტიპი რომელიც წარმოადგენს ჭეშმარიტებას და სიცრუეს student = true
