# 1)შექემენით ფუნქცია რომელსაც გადაეცემა რიცხვებიტ სავსე სია,თქვენი დავალებაა ამ სიიდან ამოშალოთ ლუწი რიცხვები
def num(arr):
    for i in arr:
        if i %2== 0:
            arr.remove(i)
    return arr
print(num([1,2,3,4,5,6]))

# 2)შექმენით სია სადაც გექნებათ მოცემული რენდომ რიცხვები,შენი დავალებაა რომ დაალაგო ეს რიცხვები ზრდადობის მიხედვით,გამოიყენეთ შესაბამისი ფუნქცია
list1 = [3,5,1,4,6,8,3,2,5,7,43,2,5]
print(sorted(list1 ,reverse=False))

# 3)შექმენი სია სადაც გექნებათ მოცემული სტრინგები,შენი დავალებაა დააბრუნო სია სადაც ეს სტრინგები დალაგებულები იქნებიან სიგრძის მიხედვით და თან შემოატრიალეთ ეს სია,გამოიყენეთ შესაბამისი ფუნქცია
str1 = ['dassdas' , 'dsd' , 'dsdsd' , 'sdsgydgwhe']
print(sorted(str1 , reverse=True , key=len))



# 4)შექმენით ფუნქცია რომელსაც გადაეცემა სია სადაც მოთავსებული იქნება როგორც სტრინგები ასევე ინტეჯერები,თქვენი დავალებაა სტრინგ ტიპის მონაცემები ჩაამატო ახალ შექმნილ სიაში და დაასორტირო ანბანის მიხედვით,ხოლო ინტეჯერებიც ჩაამატე სხვა ახალ სიაში და ეს საბოლოო სიაც დაასორტირე თან შემოატრიალე
def strint(user_int):
    st= []
    inty = []
    for i in user_int:
        if type(i) == str:
            st.append(i)
        return sorted(st , reverse=True , key= len)
    for a in user_int:
        if type(a) == int:
            inty.append(a)
        return sorted(inty,reverse=True)

print(strint(['dato', 'gio' , 'sjddns',1,3,5,2,3,5,6,3,2,5,6,7,4,3,5,9]))


# 5)შექმენი ფუნქცია სადაც იქნება მოთავსებული რენდომ ტიპის ელემენტები,თქვენი დავალებაა ამოშალოთ ამ სიიდან ბოლო ინდექსზე მდგომი ელემენტი,ჩაამატო ამ სიაში რიცხვი 20 ბოლო ინდექსზე, ამოშალო სიიდან რომელიმე სტრინგ ტიპის მონაცემი,ჩაამატო ამ სიაშ მე 4 ინდექსზე სტრინგი"atami" ,გამოიყენე შესაბამისი სიის ფუნქციები
def kus(list1):
    list1.remove('nika')
    list1.append(20)
    list1.insert(4,'atami')
    list1.pop(-1)
    return list1
print(kus(['nika' , 323 ,434, 4]))