#1 შექმენით ფუნქცია რომელიც შეამოწმებს არგუმენტად გადაცემულ სტრინგში თუ არის რიცხვი.
def str1(user_int):
    for i in user_int:
        if i == int:
            print(i)
print(str1("goabest"))

#2 შექმენით ფუნქცია რომელიც შეაბრუნებს სიის ელემენტებს, (for loop-ით)
def list1(user_list):
    for i in range(-1 ,user_list , 0):
        print(i)
print(list1([1,2,3,4,5,6,7,8]))
#3 შექმენით ფუნქცია რომელიც შეამოწმებს არის თუ არა არგუმენტად გადაცემულ სტრინგში ერთი დიდი ასო მაინც
def big(user_list):
    for i in user_list:
        if i == i.upper:
            print(i)
print(big(["goaisbest"]))

#4 შექმენით ფუნქცია რომელიც შეამბრუნებს მომხმარებლის შემოტანილ სიტყვას



#5 შექმენით სია, სადაც გამოიტანთ ელემენტებს მეორე ინდექსიდან ბოლომდე 3-ის გამოტოვებით
list1 = [1,2,3,4,5,6,7,8,9,10,11]
print(list1[3::])