# 1)შექმენით ფუნქცია რომელსაც გადაეცემა სახელებით სავსე სია,თქვენი დავალებაა გამოიტანოთ ამ სიაში მყოფი სახელების თითოეული ასო
def names(user_name):
    for i in user_name:
        return user_name
print(names(["dato" , "gio" , "tengo"]))
# 2)შექმენით ფუნქცია სადაც მოთავსებული გექნებათ რიცხვები,თქვენი დავალებაა გააარკვიოთ  ეს რიცხვი არის ლუწი და ამავდროულად დგას ლუწ ინდექსზე, მაშინ ეს რიცხვები დაამატე ახალ სიაში და იპოვეთ ამ ახალ სიაში მყოფი რიცხვების საშუალო არითმეტიკული
def list1(user_list):
    new_list = []
    for i in user_list:
        if i %2 == 0 and i.index(user_list):
            new_list.append(i)
    return new_list
print(list1([1,2,3,4,5,6,7,8,9,10]))
# 3)შექმენით ცვლადი სადაც შეინახავთ მომხმარებლის შემოყვანილ რიცხვს,თქვენი დავალებაა 1 დან მომხმარებლის შემოტანილი რიცხვის ჩათვლით გამოიტანოთ  ლუწი რიცხვების ჯამი და კენტი რიცხვების რაოდენობა,შემდეგ  გაიგეთ ამ ორი რიცხვის(საბოლოო ჯამის და საბოლოო რაოდენობის) საშუალო არითმეტიკული




# 4)მომხმარებელს შემოაყვანინე სახელი და რიცხვი,შენი დავალებაა იპოვო მომხმარებლის შემოტანილ სახელში მომხმარებლის შემოტანილ რიცხვზე რომელი ასობგერა დგას
name = input("enter name:")
num = int(input("enter name:"))
def name_num(user_name ):
    len(name) = num
    return user_name
print(name_num(name , num))

# 5)შექმენი ცვლადი სადაც შეინახავ სიას,შემდეგ მომხმარებელს შემოატანინე რაიმე რიცხვი,შენი დავალებაა სიიდან გამოიტანო მომხმარებლის შემოტანილი რიცხვიდან სიის ბოლომდე ყველა ელემენტი
list2 = [1,2,3,3,4,45,5,6,7,87]
num = int(input("enter num :"))
def lists(user_list):
    for i in user_list:
     print(num , list2)
    return user_list
print(lists(list2 , num))
# 6)მომხმარებელს შემოატანინეთ სახელი და WHILE LOOP ის დახმარებით ამ სტრინგიდან გამოიტანეთ ყოველი მეორე ასო,იგივე FOR LOOP ითაც გააკეთეთ
name = input("enter your name:")
for i in range(0 ,name , 2 ):
    print(i)



# 7)მომხმარებელს შემოაყვანინე პაროლი,ასევე შექმენი ცვლადი სადაც შეინახავ შენს პაროლს,შენი დავალებაა გააარკვიო,თუ მომხმარებლის შემოყვანილი პაროლი არ ემთხვევა შენს პატოლს მაშნ თავიდან გუამეორე რომ შემოიყვანოს პაროლი ხელახლა,შემდეგ თუ მომხმარებლის შემოტანილი პაროლი დაემთხვა შენს პაროლს დაუპრინტე რომ CORRECT \
password = input("enter your password:")
my_password = "password1234"
while password != my_password:
    input("try again:")
    print("CORRECT ")