// 1)შექმენი ცვლადი რომელშც შეინახავ ნებისმიერ ათწილად რიცხვს

// შენი დავალებაა:

// დაამრგვალო ეს ათწილადი უახლახლოეს მთელ რიცხვამდე

// დაამრგვალო ეს ათწილადი ზემოთ მყოფ მთელამდე

// დაამრგვალო ეს ათწილად ქვემოთ მყოფ მთელამდე

// და გამოიტანო მთელი ამ ათწილადი რიცხვისა

// ყველაფერი გამოიტანეთ კონსოლში'
const num = 12.3

console.log(Math.round(num))
console.log(Math.ceil(num))
console.log(Math.floor(num))
console.log(Math.trunc(num))




// 1)შექმენით ცვლადი და შეინახეთ ათწილადი რიცხვი

// შენი დავალებაა გაიგო უარყოფითა დადებითი თუ 0 გადაცემული რიცხვი .sign()

// 2)აიყვანე რიცხვი 3 რიცხვი 5 ის ხარისხში

// 3)ამოიღე ფესვი 81 დან და დაბეჭდე შედეგი

// 4)გადააქციე  უარყოფითი რიცხვი დადებით რიცხვად

// 5)იპოვე რაიმე 5 რიცხვიდან იმცირესი

// 6)იპოვე რაიმე 5 რიცხვიდან უდიდესი

// 7)დააგენერირე რაიმე რენდომ რიცხვი
const num = 12.3
const num1 = 81
const num2 = -12

console.log(Math.sign(num))
console.log(Math.pow(3,5))
console.log(Math.sqrt(num1))
console.log(Math.abs(num))
console.log(Math.min(1,2,1,2,0))
console.log(Math.max(111,3111111,223))
console.log(Math.random())

