# 1)შექმენით ცვლადი,რომელსაც გადასცემ სახელს და ეს სახელი იქნება დაწერილი პატარა ასოებით,თქვენი დავალებაა გამოიყენოთ შესაბამისი ფუნქცია და გარდაქმნათ ამ სახელის პირველი ასო დიდად
name = "dato"
print(name.capitalize())
# 2)შექმენით ცვლადი,რომელსაც გადასცემ სახელს და ეს სახელი იქნება დაწერილი პატარა ასოებით,თქვენი დავალებაა გამოიყენოთ შესაბამისი ფუნქცია და გარდაქმნათ ამ სახელის ყველა ასო დიდად
name = "dato"
print(name.upper())
# 3)შექმენით ცვლადი,რომელსაც გადასცემ სახელს და ეს სახელი იქნება დაწერილი დიდი ასოებით,თქვენი დავალებაა გამოიყენოთ შესაბამისი ფუნქცია და გარდაქმნათ ამ სახელის ყველა ასო პატარად
name = "DATO"
print(name.lower())
# 4)შექმენი ცვლადი სადაც შეინახავ სტრინგს --> "suxitashvili"  შენი დავალებაა გამოიყენო შესაბამისი ფუნქცია და გაიგო რომელ ინდექსზე დგას ასო "l"
# name= "suxitashvili"
print(name.find("l"))

# 5)შექმენი სია --> ["giorgi","lasha","beqa","aleqsandre",5] შენი დავალებაა გამოიყენო შესაბამისი ფუნქცია და გაიგო რომელ ინდექსზე დგას "aleqsandre"
# name=  ["giorgi","lasha","beqa","aleqsandre",5]
# print(name.index("aleqsandre"))

# 6)შექმენით სია სადაც გექნებათროგორც ლუწი ასევე კენტი რიცხვები,თქვენი დავალებაა გაიგოთ ამ სიაში მყოფი ლუწი რიცხვების ჯამი
list = [1,2,3,4,5,6,7,8]
sum = 0
for i in list:
    if i % 2 ==0:
        sum += i
print(sum)
