# 1)შექმენი ფუნქცია სადაც მომხმარებელს შემოაყვანინბ ორ რიცხვს და გაიგე მათი ჯამი
num1 = int(input("enter num:")) 
num2 = int(input("enter num:")) 
def num(number):
 return number
print(num(num1+num2))


# 2შექმენი ფუქნცი გადაეცი პარამეტრად ორი ცვლადი და მოახდინეთ მათი კონკატინაცია
def cv(user , user1):
 return user + user1
print(cv("dato" ,'nika'))


# 3)შექმენით სია,სადაც შეიყვანთ ინტეჯერის ტიპის მონაცემებს,თქვენი დავალება იქნება გაიგოთ ამ სიაში მყოფი ლუწი რიცხვების ჯამი
list1 = [1,2,3,4,5,6,7,8,9]
for i in list1:
 if i %2==0:
  i +i
print(list1)

# 4)შექმენით სია სადაც შეიყვანთ განსხვავებული მონაცემთთა ტიპის ელემენტებს,თქვენი დავალებაა ინტეჯერები ჩაამატო ერთ ახალ სიაშ და სტრინგები ჩაამატო სხვა ახალ სიაში
list2 = [1,"str" , True , 5.7]
lists = []
str_list =[]
for i in list2:
 if type(i) == int:
  lists.append(i)
if type(i) == str:
 str_list.append(i)
print(lists , str_list)

# 5)შექმენით სია სადაც შეიყვანთ რიცხვებს,თქვენი დავალებაა გაიგოთ ლუწ ინდექსზე მდგომი ელემენტების ჯამი
def list(user_list):
 for i in user_list:
  if i.index == i:
   i +=i 
 return user_list
print(list([1,2,3,4,5,6,7,8]))




# 6)შექმენი სია სადაც შეიყვანთ ელემენტებს,თქვენი დავალებაა ტერმინალში გამოიტანო თითოეული მათგანი გამოიყნე FOR/WHILE LOOP
list3 = [1,2,3,4,5]
for i in list3:
    print(i)


# 7)შექმენი სია სადაც გექნება ელემენტები,შენი დავალებაა ამ სიიდან ამოშალო სტრინგი მონაცემები და დააბრუნო სია სტრინგების გარეშე



# 8)შექმენი ფუნქცია სადაც მოათავსებთ სტრინგებს პატარა ასოებით,შენი დავალებაა ახალ სიაში დაამატო ეს სტრინგები მაგრამ ახალ სიაშ ჩაემატნონ დიდი ასოებით
def upp(user_patara):
    x = []
    for i in user_patara:
       x.append(i.upper())
    return x
print(upp('dato'))

# 10)შექმენი ფუნქცია სადაც მოთავსებული გექნება სტრინგები,შენი დავალებაა რომ ეს სტრინგები გადაიყვანო ახალ სიაში მაგრამ მათ პირველი ასო იყოს დიდი ახალ სიაში
def upp(user_patara):
    x = []
    for i in user_patara:
       x.append(i.capitalize())
    return x
print(upp('dato'))

# 11)შექმენი ფუნქცია რომელსაც გადაეცემა სტრინგები,შეამოწმე თუ სტრინგის პირველი ასო არის დიდი და მისი სიგრძე ნაკლებია 5 ზე ეს სტრინგები ჩაამატრ ახალ სიაში,შემდეგ ამ ახალ სიაში ჩამატებული ელემენტები გაფილტრეთ(sorted) მათი სიგრძის მიხედვით და ეს სია შემოატრიალეთ
def strs(user_str):
    y = []
    for  i in user_str:
        if i == i.capitalize and len(i) <5:
            y.append(sorted(i , reverse=True))
    return y
print(strs(["dgad"]))


# 12)შექმენი სია სადაც გექნება სტრინგები და რიცხვები,რიცხვებიგადაიტანე ახალ სიაში და დაალაგე ზრდის მიხევდით სტრინგებიც ჩაამატე სხვა ახალ სიაში და ეს სტრინგების სია დააალაგეთ ანბანის მიხევდით
lists1=['dagdsd' , 21221,'dssdsd',44]
list4 = []
list5 = []
for i in list1:
  if type(i) == int:
    list4.append(sorted(i , reverse=True))
  if type(i) == str:
    list5.append(sorted(i))
print(list4 , list5)


# 13)შექმენი სია სადაც მოთავსებ ელემენტებს,შენი დავალებაა ამ სსიიდან ამოშალო მესამე ინდექსზე მდგომი ელემენტი,ამ სიაშ ჩაამატე სახელი "ირაკლი" , ასევე გაიგე მეხუთე  რომელიმე ელემენტის ინდექსი(შესაბამისი ფუნქციის დახმარებით) , ასევე გაიგე ამ სიის სიგრძე , და ბოლოს სიიდან ამოშალე რომელიმე ელემენტი (შესაბამისი ფუნქციის დახმარებით(სახელის მიხედვით))
list6 = [122121,21212121,77656,"zangi"]
list6.pop(3)
list6.append("irakli")
print(list6)

# 14)შექმენი ფუნქცია რომელსაც გადაეცემა ერთმთლიანი წინადადება,ამ წინადადებაშ სიტყვები გამოყოფილები უნდა იყვნენ სპეისებთ,შენი დავლაებაა ამ სტრინგშ მოთავსებული ყველა სიტყვა გადაიყვანო სიაში(სესაბამისი ფუქნცია)
def split(user_split):
   x= user_split.split(" ")
   return x
print(split(['hidroeleqtrosadguri']))


# 15)შექმენი ფუნქცია რომელსაც გადაეცემა სია,შენი დავალებაა ეს სია აქციო სტრინგად დად თითოეული ელემენტი დაშორებული იყოს # ამ ნიშნით,შემდეგ გადაუარეთ ამ სტრინგს და დაითვალეთ თუ რამდენჯერ გვხვდება # ეს ნიშანი შენს სტრინგში


# 16)შექმენი ფუნქცია რომელსაც გადაეცემა რიცხვებით სავსე სია,შენი დავალებაა ახალ სიაში ჩაამატო კენტი რიცხვები,შემდეგ ამ ახალ სიაში მყოფი რიცხვების საშუალო არითმეტიკული გიაგეთ
def nums(user_num):
  odd = []
  for i in user_num:
    if i %2!=0:
      odd.append(i)
    if odd:
      tt = sum(odd)
      gg =tt / len(odd)
    return gg
print(nums([1,2,3,4,5,6,7,8]))



# 17)შექმენით ფუნქცია რომელსაც გადაეცემა სტრინგებით სავსე სია,შენი დავალებაა შეამოწმო თუ რამდენი ცალი დიდი ასო ურევიაა ყველა სტრინგში მთლიანად
def nun(user_num):
  lenu = []
  for i in user_num:
    if i == i.upper():
      lenu +=i
  return lenu
print(nun("dsdfsgdsdsgdsgd"))



# 18)while loop/for loop დაითვალე 40 დან 100 მდე 
for i in range(40 , 100):
  print(i)


num = 40
while num <=100:
  print(num)
  num +=1



# 19)შექმენი ცვლადი სადაც შეინახავ შენ პაროლს,შემდეგ მომხმარებელს შემოატანინე პაროლკსანამ მომხმარებელი სწორად არშემოიყვანს პაროლს იქამდე გაუმეორე რომ შემოიყვანოს თავიდან პაროლი
my_password = "dato1234"
pw = input("enter password")
while pw !== my_password
  input("try again:")
print("good" )

# 20)შექმენი სია,სადაც მოათავსებთ ელემენტებს,შენი დავალებაა ეს სია გადააქციო სტრინგად,სადაც სიტყვებს გამოყობთ სფეისით,შემდეგ გადაუარეთ ამ სტრინგს და შეამოწმეთ თ ამ სტრინგში არის ხმოვნები ეს ხმოვნები ჩაანაცვლეთ $ ამ ნიშნით და ისე დააბრუნეთ საბოლოო სტრინგი
lists = ['dsshdd' , 'dsdgsydgsd', 'dsdsdsd']
x = lists.split(" ")
for i in x:
  if i == 'aeiou':
    '$'.join(i)
print(x)

# 21)დაწერეთ ფუნქცია, რომელიც for ციკლის გამოყენებით ითვლის მასივში რამდენი ელემენტია 10-ზე მეტი.
def count(user_count):
  cn = 0
  for i in user_count:
    if i >10:
      cn +=1
  return cv
print(count(int(input("enter num:"))))


# 22)შექმენით ფუნქცია რომელიც აბრუნებს სტრინგში ხმოვნების რაოდენობას
def count(user_words):
    vv = 'aeiouAEIOU'
    count = 0
    for i in user_words:
            if i in vv:
             count +=1
    return vv
print(count('f dgdsakmddgfe'))

# 23)შექმენი ფუნქცია რომესლაც გადასცემთ სახელების სიას,შენი დავალებაა დაასორტირო ეს სია ანბანის მიხედვით და შეამოწმო თ ამ დასორტირებულ სიაში პირველი ასო არის ხმოვანი დაპრინტე რომ კარგია,სხვა შემთხვევაში დაპრინტე რომ ცუდია
def sor(user_sort):
  for i in user_sort:
    if sorted(i[0]) is 'aeiou':
      print("goood")
    else:
      print("bad")


# 24)შექმენი ფუნქცია რომელსაც გადაეცემა ორი სია,შენიდვავლებაა გააერთანო ეს ორი სია ერთმანთიში(გამოიყენე შეაბამისი ფუნქცია)
list1 =[1,2,3,4,5,6,6,7,8]
list2 =['dadsgdsd']
list1.extend(list2)
print(list1) 


# 25)შექმენი ფუნქცია რომელსაც გადაეცემა რიცხვების სია,შენი დავალებაა გაიგო რიცხვების ჯამი რომლებიც დგანან კენტ ინდექსზე და ასევე არიან 20 ზე ნაკლები
def lists(user_list):
  for i in user_list:
    if i %2 ==0 , and i< 20:
      i +=i
    return i
print(lists([1,2,3,43,4,5,6,6,7,8,8,98]))