# 1)შექმენი სია,რომელსაც გადასცემთ რიცხვების სიას,თქვენი დავალებაა ეს სია დაასორტიროთ ზრდადობის მიხედვით და თან შემოატრიალეთ

list1 = [1,2,3,4,5,6,3,4,67,343,5,78,6,23,5,65,3,32,4]
print(sorted(list1 , reverse=True))


# 2)შექმენი სია სადაც მოცემუილი იქნება სახელები თქვენი დავალებაა დაასორტიროთ ეს სახელები ანბანის მიხედვით და თან შემოატრიალოთ
list2 = ["dato" , 'avto' , 'givi' , 'babu']
print(sorted(list2 , reverse=True))

# 3)შექმენი ფუნქცია რომელსაც გადაეცემა სხვადასხვა მონაცემთა ტიპები,შენი დავლებაა სიიდან ამოიღო მხოლოდ სტრინგ ტიპის მონაცემები რომლების სიგრძეც არის ნაკლები 5 ზე და იწყება დიდი ასოთი და დაამატო ახალ სიაში,შემდეგ ეს სია დაასორტირე სიგრძის მიხედვით და შემოატრიალეთ
def nm(user_name):
    new = []
    for i in user_name:
        if i ==str  and  len(i) < 5 and i == i.capitalize():
            new.append(i)
    x = sorted(new , key=len , reverse=True)
    return x
print(nm([1,'Gvgd',6.9]))


# 4)შექმენი ფუნქცია რომელსაც გადაეცემა სია,შენი დავალებაა შეამოწმო თუ ამ სიაში მყოფი სახელების სიმბოლოები დგანან კენტ ინდექსზე და ასევე არიან lowercase ები,ჩაამატო ერთ მთლიან სიაში ასეთი ასოები
def kenti(user_list):
    new = []
    for i in user_list:
        if  i[3].index and i.lower:
            new.append(i)
    return new
print(kenti(['dadgfv ''gdbwdu ''egbfeu' 'gbreu']))

# 5)შექმენი ფუნქცია რომელსაც გადასცემ სიას,თქვენი დავალებაა ახალ სიაში დაამატოთ ეს სახელები ოღონდ ყველა ასო იყოს დიდი ამ სტრინგებში
def name(user_name):
    new = []
    for i in user_name:
        i.upper()
        new.append(i)
    return i
print(name(["dato" , 'gio' , 'luka']))