/*
1)მომხმარებელს შემოაყვანინეთ რაიმე რიცხვი
შენი დავალებაა შეამოწმო ტერნარით --> თუ ეს რიცხვი არის ლუწი გამოიტანეთ --> "even" სხვა შემთხვევაშ გამოიტანეთ "odd"
let name = Number(prompt("enter num"))
name % 2 === 0 ? console.log("even") : console.log("odd") 
2)მომხმარებელს შემოატანინე რაიმე სტრინგი,შემდეგ შეამოწმე თ ამ სტრინგის სიგრძე მეტია 5 ზე გამოიტანე --> "big string" სხ ვა შემთხვევაში "short string"
let str = prompt("enter str")
str.length > 5 ? console.log("big str"): console.log("short str")  
*/
/*
3) შექმენი ცვლადი სადაც შეინახავ რაიმე რიცხვს

შემდეგ switch ის დახმარებით შეამოწმე

თუ ცვლადში შენახული მნშვნელობა არის 1 --> დალოგე --> ორშაბათი

თუ ცვლადში შენახული მნშვნელობა არის 2 --> დალოგე --> სამშაბათი

თუ ცვლადში შენახული მნშვნელობა არის 3 --> დალოგე --> ოთხშაბათი

თუ ცვლადში შენახული მნშვნელობა არის 4 --> დალოგე --> ხუთშაბათი

თუ ცვლადში შენახული მნშვნელობა არის 5 --> დალოგე --> პარასკევი

თუ ცვლადში შენახული მნშვნელობა არის 6 --> დალოგე --> შაბათი

თუ ცვლადში შენახული მნშვნელობა არის 7 --> დალოგე --> კვირა

სხვა შემთხვევაში დალოგე --> ასეთი კვირის დღე არ არსებობს
*/

const num = 7

switch(num){
    case 1 :
        console.log("ორშაბათი")
        break
    case 2:
        console.log("სამშაბათი")
        break
    case 3 :
        console.log("ოთხშაბათი")
        break
    case 4:
        console.log("ხუთშაბათი")
        break
    case 5 :
        console.log("პარასკევი")
        break
    case 6:
        console.log("შაბათი")
        break
    case 7:
        console.log("კვირა")
        break
    default :
        console.log("ასეთი კვირის დღე არ არსებობს")
        break
    }       


