/*1)კომენტარის სახით ახსენით თუ რა არის typeof და რაში გვეხმარება ის

2)შექმენი ცვლადი და შეინახე რაიმე რიცხვი,შენი დავალებაა გამოიტანო ამ ცვლადში შენახული ელემენტის მონაცემთა ტიპი

3)შექმენი ცვლადი და შეინახე რაიმე სტრინგი,შენი დავალებაა გამოიტანო ამ ცვლადში შენახული ელემენტის მონაცემთა ტიპი

4)შექმენი ცვლადი და შეინახე boolean ტიპის მონაცემი,შენი დავალებაა გამოიტანო ამ ცვლადში შენახული ელემენტის მონაცემთა ტიპი

5)შექმენი ცვლადი და შეინახე undefined,შენი დავალებაა გამოიტანო ამ ცვლადში შენახული ელემენტის მონაცემთა ტიპი

6)შექმენი ცვლადი სადაც შეინახავ სტრინგს,შემდეგ დაბეჭდე ამ ცვლადში შენახული ელემენტის ტიპი,შემდეგ განაახლე ამ ცვლადის მნიშვნელობა და შეინახე რაიმე რიცხვი,შემდეგ გამოიტანე განახლებული ცვლადს მონაცემთა ტიპი

7)გაქვს ცვლადები:
let name = "Goga";
let age = 16;

შექმენი სტრინგი interpolation-ით:
"My name is Goga and I am 16 years old"

8)გაქვს ცვლადები: 

let a = 5;
let b = 3;

შექმენი სტრინგი:

"The sum of 5 and 3 is 8"

გამოიყენე interpoaltion

9)შექმენი ცვლადები შენს შესახებ,შენი დავალებაა რომ გამოიტანო ერთი წიანდადება შენს შესახებ სადაც გამოიყენებ ცვლადის მნიშვნელობებს,გამოიყენე interpoaltion

10)კომანტარის სახით ახსენით თუ რისი მეთოდებია --> .toUpperCase() , .toLowerCase() , .startsWith() , .trim() თითოეულ მათგანს მიუწერე თუ რომელი რაში გამოიყენება

11)let str = "HELLO";

გადააკეთე პატარა ასოებად

შედეგი: "hello"

12)let name = "GoGa";

გააკეთე ისე, რომ მთლიანად პატარა ასოებით გამოვიდეს

13)let word = "javascript";

გადააკეთე დიდ ასოებად
შედეგი: "JAVASCRIPT"

14)let city = "tbilisi";

დაბეჭდე დიდ ასოებში

15)let str = "Hello world";

შეამოწმე იწყება თუ არა "Hello"-ით ზემოთ მოცემული წინადადება

გამოიტანე true ან false
*/
