# 1)შექმენით ცვლადი სადაც შეინახავთ რაიმე სტრინგს,გაიგეთ თთოეული ასოს ინდექსი(გამოიყენეთ შესაბამისი ფუნქცია)
# str1  = "goa best"
# for i in str1:
#     print(str1.find(i))

# 2)შექმენით სია სადაც მოათავსებ ლეემენტებს,შენი დავალებაა გამოიტანო სიაში მყოფი ელემენტების ინდექსები(გამოიყენეთ შესაბამისი ფუნქცია)
# list1 = [True , False , "google" , 15 , 15.3]
# for i in list1:
#     print(list1.index(i))

# 3)შექმენით სია სადაც მოათავსებ 5 ელემენტს,შენი დავალებაა მე-3 ე ინდექსზე ჩაამატო სხვა ელემენტი(გამოიყენე შესაბამისი ფუნქცია)
# list2 = [True , False , "google" , 15 , 15.3] 
# list2.insert(3,"str")
# print(list2)

# 4)შექმენი სია სადაც გექნება 5 ელემენტი,შენი დავალებაა სიის ბოლოში დაამატო რაიმე ელემენტი(გამოიყენე შესაბამისი ფუნქცია)
# list3 = [True , False , "google" , 15 , 15.3]
# list3.append(16)
# print(list3)

# 5)შექმენი სია სადაც გექნება ელემენტები,შენი დავალებაა ამ სიიდან ამოშალო მე-3 ინდექსზე მდგომი ელემენტ
# list3 = [True , False , "google" , 15 , 15.3]
# list3.pop(3)
# print(list3)

# 6)შექმენი ფუნქცია რომელსაც გადაეცემა სია,ამ სიაში მოთავსებული უნდა იყოს როგორც სტრინგები ასევე ინტეჯერები,შენი დავალებაა სიიდან ამოშალო მხოლოდ სტრინგის ტიპის ელემენტები,რაც შეეხება ინტეჯერებს ჩაამატეთ ახალ სიაში
# def lists(user_list):
#     new_list = []
#     for i in user_list:
#         if type(i) == int:
#             new_list.append(i)
#         elif type(i) == str:
#             user_list.remove(str)
#     return new_list
# print(lists(["dato" , 15 , 23]))

# 7)შექმენით ფუნქცია რომელიც ამოშლის სიიდან ლუწ ინდექსზე მდგომ ელემენტებს , და კენტ ინდექსზე მდგომ ელემენტებს ჩაამატებს ახალ სიაში
# def luw(user_luwi):
#     new = []
#     for  i in user_luwi:
#         if i %2 ==0:
#             user_luwi.remove(i)
#         elif i %3 == 0:
#             new.append(i)
#     return new
# print(luw(1,2,3,4,5,6,78))


# 8)შექმენი ფუნქცია რომელსაც გადაეცემა სია,შენი დავალებაა იპოვო ამ სიიდან ლუწი რიცხვები და ჩაამატო ახალ სიაში,შემდეგ ამ სიიდან უნდა გაიგოთ კენტ ინდექსზე მდგომი რიცხვების კვადრატების ჯამი
def my_list(user_lis):
    new = []
    for i in user_lis:
        if i %2== 0:
            new.append(i)
        elif new %3==0:
            new*new
    return new
print(my_list([1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]))


# 9)შექმენით ფუნქცია,რომელსაც გადაეცემა სტრინგებით სავსე სია,შენი დავალებაა შეამოწმო,თუ სტრინგი შეიცავს კენტი რაოდენობის ასობგერას,მაგ შემთხვევაში ჩაამატეთ ახალ სიაში,ხოლო თ შეიცავს ლუწი რაოდენობის ასობგერას შენი დავალებაა ესენიც ჩაამატო ახალ სიაშ ოღნდ მათ ასოები იყოს დიდი
def kenti(user_kenti):
   new = []
   for i in user_kenti:
        if i %3 ==0:
          new.append(i)
        elif i %2==0:
            new.append(i.upper()) 
        return new
print(kenti(["goaisbest"]))


# 10)შექმენით ფუნქცია რომელსაც გადაეცემა სტრინგებით სავსე სია,შენი დავალებაა გაიგო,თუ ეს სიტყვა არის capitalize მაგ შემთხვევაში დაამატა მსსგავსი სტრინგები სხვა სიაში,თუ სიტყვა არის upper დაამატე ეს სტრინგი სხვა ახალ სიაში,და თუ ეს სიტყვა არის lower მაშინ დაამატე ეს სიტყვები სხვა ახალ სიაში,შემდეგ სამივე სიაში მოცემული ელემენტები დააბრუნეთ ოღონდ სტრინგის სახით და თითოეული სტრინგი ერთმანეთსგან დაშორებული იიყოს $ ნიშნით
def list1(user_list):
    list2 = []
    list3 = []
    list4 = []
    
    for i in user_list:
        if i == i.capitalize():
            i.append(list2)
        elif i == i.upper():
            i.append(list3)
        elif i == i.lower():
            i.append(list4)
    return "$".join(list2 , list3 , list4)
print(list1(["dato" , "gio" , "syr"]))