/*1) მომხმარებელს შემოატანინე ორი ნამბერ ტიპის მონაცემი(გადააქციეთ ორივე შემოყვანილი რიცხვად<-- არ დაგავიდყდეთ)
შემდეგ შეადარეთ არის თუ არა პირველი რიცხვი მეტი მეორე რიცხვზე(არ გჭირდებათ if else )პირდაპირ კონსოლში შეამოწმეთ'

let nm = Number(prompt("entrt num") ) 
let nm1 = Number(prompt("entrt num") ) 
console.log(nm > nm1)

2) მომხმარებელს შემოატანინეთ ორი რიცხვი როგორც ზემოთ , შემდეგ შეამოწმეთ არის თუ არა პირველი რიცხვი ტოლი(მკაცრი) მეორე რიცხვზე
let nm = Number(prompt("entrt num") ) 
let nm1 = Number(prompt("entrt num") )
console.log(nm === nm1)

3)მომხმარებელს შემოატანინე ორი სტრინგი ,შეამოწმე არის თუ არა ორივე სტრინგი ერთმნაირი(მკაცრი)
let nm = (prompt("entrt num") ) 
let nm1 = (prompt("entrt num") )
console.log(nm === nm1)


*/

