/*11)შექმენი 4 ცვლადი let ის გამოყენებით,

1)name
2)surname
3)age
4)adress

გამოიტანე შემდეგნაირი ტექსტი : hello,my name is ... ,my surname is ... and my age is ... age , i live in ... . 

სამი წერტილის მაგივრად უნდა ჩასვათ ცვლადის მნიშვნელობები,გამოიყენეთ string interpolation --> `...${}...`
*/
let name = "dato"
let surname = "miribiani"
let age = 15
let adrees = 'temka'
console.log(`hello,my name is ${name}  and  my age is ${surname}, i live in ${adrees} `)

// 12)რას აკეთებს თითოეული მათგანია ახსენით:+= -= *== /= ++ --
// +=  mokle chanaweri amatebs 
// -=  mokle chanaweri aklebs
// *= mokle chanaweri gamravlebis 
// /= mokle chanaweri gayofistvis 
// ++ amatebs 1
// -- aklebs 1

// 12)შექმენი ცვლადის სადაც შეინახავ number ტიპის მონაცემს,შემდეგ გაზარდე ამ ცვლადის მნიშვნელობა 5 ით(გამოიყენე შესაბამისი ოპერატორი),დაბეჭდე ცვლადი რომ ნახო შედეგი 
let num = 15
let ww = 5
console.log(num + 5)

// 13)შექმენი ცვლადის სადაც შეინახავ number ტიპის მონაცემს,შემდეგ შეამცირე ამ ცვლადის მნიშვნელობა 3 ით(გამოიყენე შესაბამისი ოპერატორი),დაბეჭდე ცვლადი რომ ნახო შედეგი
let num1 = 17
let name = 3
console.log(num - name)

// 14)შექმენი ცვლადის სადაც შეინახავ number ტიპის მონაცემს,შემდეგ შეამცირე ამ ცვლადის მნიშვნელობა 3 ით(გამოიყენე შესაბამისი ოპერატორი),დაბეჭდე ცვლადი რომ ნახო შედეგი
let num2= 15
let nun = 3
console.log(num2 -- nun )

// 15)შექმენი ცვლადის სადაც შეინახავ number ტიპის მონაცემს,შემდეგ გაამრავლე ამ ცვლადის მნიშვნელობა 6 ზე(გამოიყენე შესაბამისი ოპერატორი),დაბეჭდე ცვლადი რომ ნახო შედეგი
let num4 = 25
let nan = 6
console.log(num4 *= nan)

// 16)შექმენი ცვლადის სადაც შეინახავ number ტიპის მონაცემს,შემდეგ გაყავი ამ ცვლადის მნიშვნელობა 2 ზე(გამოიყენე შესაბამისი ოპერატორი),დაბეჭდე ცვლადი რომ ნახო შედეგი
let number = 30
let number2 = 2
console.log(number /= number2)

// 17)შექმენი ცვლადი და შეინახე რიცხვი,შენი დავალებაა შესაბამისი ოპერატორით გაზარდო ამ ცვლადის მნშვნელობა 1 ით(გამოიყენე შესაბამისი ოპერატორი),დაბეჭდე ცვლადი რომ ნახო შედეგი
let number5 = 12
let number3 =1
console.log(number5 += number3)
// 18)შექმენი ცვლადი და შეინახე რიცხვი,შენი დავალებაა შესაბამისი ოპერატორით შეამცირო ამ ცვლადის მნშვნელობა 1 ით(გამოიყენე შესაბამისი ოპერატორი),დაბეჭდე ცვლადი რომ ნახო შედეგი
let number5 = 12
let number3 =1
console.log(number5 -= number3)
