# 1)შექმენით ფუნქცია რომელსაც გადაეცრმა რიცხვებით სავსე სია,თქვენი დავალებაა ამ სიიდან ამოიღოთ მხოლოდ ლუწი რიცხვები  ჩაამატო ახალ დიაში და დაალაგო ასევე ზრდის მიხედვიტ
# def num(arr):
#     aa = []
#     for i in arr:
#         if i %2==0:
#             aa.append(i)
#     return sorted aa
# print(num(1,3,4,5,6,7,8,9,10))

#  კომენტარის სახით ჩამoწერეთ სიის ფუნქციები და გვერდით მიუწერეთ ასევე თუ რომელი რას აკეთებს
# sorted აბრუნებს დალაგებულ სიას
# min მინიმალური რიცხვი
# max მახსიმალური რიცხვი
# len აბრუნებს სიისს სიგრძეს


# 3)შექმენი სია სადაც მოათავსებ 5 ელემენტს,შენი დავალებაა მეორე ინდექსზე მდგომი ელემენტის მნიშვნელობა შეცვალო “გელა” თი და მეოთხე ინდექსზე მდგომი ელემენტის მნიშვნელობა შეცვალო “საბა” თი
lt = [ 1 , 1.2,"luka",11,345 ]
lt[2] = "gela"
lt[4]= 'saba'
print(lt)

# 4)შექმენი ფუნქცია ამ ფუნქციას გადაეცი რიცხვებით სავსესია ,ეს რიცხვენი ამ სიაში უ და მეორდებოდნენ, გამოიყენე ისეთი ფუნქცია და დააბრუნე ისეთი სია რომ ამ სიაში განმეორებადიელემენტები აღარ იყვნენ
list1 = [1,1,1,2,2,2,4,4,4,2,1,3,5,6,7,5,3,,5,67,8,6,43,2,3456,78,765,43,2,4567,2]
print(sorted(set(list1)))
