# 1)შექმენით სია სადაც მოთავსებული გექნებათ სახელები,თქვენი დავალებაა სიის ბოლოში დაამატოთ "ფორთოხალი",მოიყვანე კიდევ ორი მაგალითი სადაც დაამატებ სხვა ელემენტებს სიაში
name = ["dato" "gio" , "nika"]
name.append("fortoxali")
print(name)

name = ["dato" "gio" , "nika"]
name.append("kvati")
print(name)

name = ["dato" "gio" , "nika"]
name.append("lekso")
print(name)

# 2)შექმენით სია სადაც გექნებათ მოთავსებული 7 სახელი,თქვენი დავალებაა მესამე ინდექსზე დაამატო "mtvare" და მეხუთე ინდექსზე დაამატო რიცხვი 65
list1 = ["dato" "gio" , "nika" "dato" "gio" , "nika" , "lekso"]
list1.insert(3,"mtvare")
list1.insert(5,65)

# 3)შექმენით სია სადაც გექნებათ მოთავსებული ყველა მონაცემთა ტიპის ელემენტი,თქვენი დავალებაა ამ სიიდან ამოშალოთ მესამე და ბოლო ინდექსზე მდგომი ელემენტები,გამოიყენეთ pop() ფუნქცია
list2 = ["dato" , True , 15 , 168.0 , 15]
list2.pop(3)
list2.pop(-1)
print(list2)
# 4)შექმენით სია --> ["giorgi" , "lasha", "beqa" , "irakli" , 45] თქვენი დავალებაა ამ სიიდან ამოშალოთ "lasha" და ასევე ამოშალოთ რიცხვი 45,გამოიყენეთ remove() ფუნქცია
list3 =["giorgi" , "lasha", "beqa" , "irakli" , 45] 
list3.remove("lasha")
list3.remove(45)
print(list3)

# 5)კომენტარის სახით დაწერეთ რა განსხვავება და მსგავსებაა remove და pop ფუნქციებს შორის 
# pop ში ვწერ რომელი სის მონაცემის რიცხვს და remove ში კი ეგრევე რისი წაშლაც გვინდა

